Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.
NaN (not a number) is the standard missing data marker used in pandas.

In [4]:
import numpy as np
import pandas as pd

s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s

a   -1.025910
b   -0.042074
c    0.106637
d    0.997963
e   -0.210344
dtype: float64

In [5]:
#instantiating series from dicts
d= {"b": 1, "a": 0, "c": 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [6]:
#from a scaler value
pd.Series(5.0, index=["a", "b", "c", "d", "e"])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [7]:
#Series name attribute
s = pd.Series(np.random.randn(5), name="something")
s.name

'something'

In [8]:
s2 = s.rename("different")
s2.name
#Note that s and s2 refer to different objects.

'different'

DataFrame
DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

Dict of 1D ndarrays, lists, dicts, or Series
2-D numpy.ndarray
Structured or record ndarray
A Series
Another DataFrame

DataFrame is not intended to work exactly like a 2-dimensional NumPy ndarray.

In [9]:
#DataFrame from dict of series or dicts
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [10]:
#When a particular set of columns is passed along with a dict of data, the passed columns override the keys in the dict.
pd.DataFrame(d, index=["d", "b", "a"], columns=["two", "three"])

   two three
d  4.0   NaN
b  2.0   NaN
a  1.0   NaN

In [11]:
#From dict of ndarrays / lists
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}
pd.DataFrame(d)

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [12]:
#Index overriding
pd.DataFrame(d, index=["a", "b", "c", "d"])

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [13]:
#From structured or record arra
data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "S10")])
data[:] = [(1, 2.0, "Hello"), (2, 3.0, "World")]
pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [14]:
#From a list of dicts
data2 = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [15]:
#From a dict of tuples
pd.DataFrame(
    {
        ("a", "b"): {("A", "B"): 1, ("A", "C"): 2},
        ("a", "a"): {("A", "C"): 3, ("A", "B"): 4},
        ("a", "c"): {("A", "B"): 5, ("A", "C"): 6},
        ("b", "a"): {("A", "C"): 7, ("A", "B"): 8},
        ("b", "b"): {("A", "D"): 9, ("A", "B"): 10},
    }
)

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

In [16]:
#From a Series
ser = pd.Series(range(3), index=list("abc"), name="ser")
pd.DataFrame(ser)

   ser
a    0
b    1
c    2

In [17]:
#From a list of namedtuples
from collections import namedtuple
Point = namedtuple("Point", "x y")
pd.DataFrame([Point(0, 0), Point(0, 3), (2, 3)])

   x  y
0  0  0
1  0  3
2  2  3

In [18]:
'''
From a list of dataclasses
Data Classes as introduced in PEP557, can be passed into the DataFrame constructor. 
Passing a list of dataclasses is equivalent to passing a list of dictionaries.
Please be aware, that all values in the list should be dataclasses, mixing types in the list would result in a TypeError.
'''
from dataclasses import make_dataclass
Point = make_dataclass("Point", [("x", int), ("y", int)])
pd.DataFrame([Point(0, 0), Point(0, 3), Point(2, 3)])

   x  y
0  0  0
1  0  3
2  2  3

Alternate constructors
DataFrame.from_dict

DataFrame.from_dict() takes a dict of dicts or a dict of array-like sequences and returns a DataFrame. It operates like the DataFrame constructor except for the orient parameter which is 'columns' by default, but which can be set to 'index' in order to use the dict keys as row labels.

DataFrame.from_records

DataFrame.from_records() takes a list of tuples or an ndarray with structured dtype. It works analogously to the normal DataFrame constructor, except that the resulting DataFrame index may be a specific field of the structured dtype.

In [19]:
pd.DataFrame.from_dict(dict([("A", [1, 2, 3]), ("B", [4, 5, 6])]))

   A  B
0  1  4
1  2  5
2  3  6

In [20]:
pd.DataFrame.from_records(data, index="C")

          A    B
C
b'Hello'  1  2.0
b'World'  2  3.0

Column selection, addition, deletion

In [22]:
df["two"]

a    1.0
b    2.0
c    3.0
d    4.0
Name: two, dtype: float64

In [24]:
df["three"] = df["one"] * df["two"]
df["flag"] = df["one"] > 2
df

   one  two  three   flag
a  1.0  1.0    1.0  False
b  2.0  2.0    4.0  False
c  3.0  3.0    9.0   True
d  NaN  4.0    NaN  False

In [25]:
#Popping or deleting columns
del df["two"]
three = df.pop("three")
df

   one   flag
a  1.0  False
b  2.0  False
c  3.0   True
d  NaN  False

In [27]:
# Inserting a scalar value will naturally be propagated to fill the column
df["scaler propagation"] = "propagated"
df

   one   flag  foo scaler propagation
a  1.0  False  bar         propagated
b  2.0  False  bar         propagated
c  3.0   True  bar         propagated
d  NaN  False  bar         propagated

Assigning new columns in method chains
Inspired by dplyr’s mutate verb, DataFrame has an assign() method that allows you to easily create new columns that are potentially derived from existing columns.

In [32]:
claims = pd.read_csv(r"C:\Users\Lenovo\Downloads\claim1.csv")
claims.assign()
claims.head()

,PAYROLL,CLAIMANT'S NAME,ID NUMBER,DATE OF LOSS,INTIMATION DATE,BRITAM CLAIM NO.,NATURE OF LOSS,SCHEME,NATURE OF INJURY,SERVICE,...,Documentation TAT,DV ISSUED DATE,DV ISSUE TAT,DV RECEIVED DATE,date paid/declined,DATE REMITTED,TAT FINANCE,payment requisition no.,STATION,Column1
0,29302402.0,JOSEPH KAHUGU WAMBUGU,29302402.0,22/06/2023,04-Oct-23,552/092/5/001136/2023/10,DEATH,GPA,ASSAULT,KENYA POLICE,...,10/04/2023,04-Oct-23,0.00,11-Oct-23,11-Oct-23,18-Oct-23,7.0,"202012523202310, 202012519202310, 202012517202...",NaN,NaN
1,29531579.0,ANTONY ALFRED MANYASI,29531579.0,05/09/2023,20-Apr-23,552/092/5/000916/2023/06,INJURY,GPA,RTA,KENYA POLICE,...,153,NaN,400.42,NaN,NaN,NaN,NaN,NaN,NAIROBI,NaN
2,10846010.0,JOSEPH MACHARIA MWANGI,10846010.0,17/06/2023,28-Jul-23,552/092/5/001041/2023/08,DEATH,GPA,FALL,KENYA PRISONS,...,0,NaN,454.42,04-Aug-23,04-Aug-23,05-Aug-23,1.0,2.02E+14,NaN,NaN
3,NaN,TIMOTHY MUGENDI RUCHAH,NaN,12/01/2023,08-Jun-23,552/110/5/004133/2023/11,INJURY,WIBA,BRAIN INJURY,ADMINISTRATION POLICE,...,14,26-Jun-23,4.00,NaN,NaN,NaN,NaN,NaN,NAIROBI,NaN
4,30122505.0,SILAS MURIUKI KINOTI,30122505.0,17/02/2023,27-Apr-23,552/092/5/000999/2023/07,INJURY,GPA,BRAIN INJURY,KENYA POLICE,...,85,NaN,461.42,NaN,NaN,NaN,NaN,NaN,NAIROBI,NaN